<template>
  <div v-if="modal" class="modal">
    <div class="modal_con">
      <div class="modal_header">
        <h2>{{ modalText }}</h2>
        <div class="modal_close_btn position-relative" @click="closeModal">
          <i
            class="bx bx-x fs-1 position-absoulte"
            style="top: -3px; left: -3px"
          ></i>
          <!-- <img src="@/assets/img/modal_close.svg" alt="모달 닫기 아이콘" /> -->
        </div>
      </div>
      <div class="modal_text text-start">
        <div v-if="modalText === '서비스 이용약관'">
          <h3>제 1 조 (목적)</h3>
          <p>
            이 약관은 주식회사 티디아이 플레이(이하 "회사" 또는 " 정음 ")가
            제공하는 정음 관련 제반 서비스의 이용과 관련하여 회사와 회원과의
            권리, 의무 및 책임사항, 기타 필 요한 사항을 규정함을 목적으로
            합니다.
          </p>
          <h3>제 2 조 (정의)</h3>
          <p>이 약관에서 사용하는 용어의 정의는 다음과 같습니다.</p>
          <ol>
            <li>
              ① "서비스"라 함은 구현되는 단말기(PC, TV, 휴대형단말기 등의 각종
              유무선 장치를 포함)와 상관없이 "회원"이 이용할 수 있는 정음 관련
              제반 서비스를 의미합니다.
            </li>
            <li>
              ② "회원"이라 함은 회사의 "서비스"에 접속하여 이 약관에 따라
              "회사"와 이용계약을 체결하고 "회사"가 제공하는 "서비스"를 이용하는
              고객을 말합니다.
            </li>
            <li>
              ③ "아이디(ID)"라 함은 "회원"의 식별과 "서비스" 이용을 위하여
              "회원"이 정하고 "회사"가 승인하는 문자와 숫자의 조합을 의미합니다.
            </li>
            <li>
              ④ "비밀번호"라 함은 "회원"이 부여 받은 "아이디와 일치되는
              "회원"임을 확인하고 비밀보호를 위해 "회원" 자신이 정한 문자 또는
              숫자의 조합을 의미합니다.
            </li>
            <li>
              ⑤ "포인트"라 함은 서비스의 효율적 이용을 위해 회사가 임의로 책정
              또는 지급, 조정할 수 있는 재산적 가치가 없는 "서비스" 상의 가상
              데이터를 의미합니다.
            </li>
            <li>
              ⑥ "게시물"이라 함은 "회원"이 "서비스"를 이용함에 있어 "서비스상"에
              게시한 부호ㆍ문자ㆍ음성ㆍ음향ㆍ화상ㆍ동영상 등의 정보 형태의 글,
              사진, 동영상 및 각종 파일과 링크 등을 의미합니다.
            </li>
          </ol>
          <h3>제 3 조 (약관의 게시와 개정)</h3>
          <ol>
            <li>
              ① "회사"는 이 약관의 내용을 "회원"이 쉽게 알 수 있도록 서비스 초기
              화면에 게시합니다.
            </li>
            <li>
              ② "회사"는 "약관의규제에관한법률",
              "정보통신망이용촉진및정보보호등에관한법률(이하 "정보통신망법")" 등
              관련법을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.
            </li>
            <li>
              ③ "회사"가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여
              현행약관과 함께 제1항의 방식에 따라 그 개정약관의 적용일자 30일
              전부터 적용일자 전일까지 공지합니다. <br />다만, 회원에게 불리한
              약관의 개정의 경우에는 공지 외에 일정기간 서비스내 전자우편,
              전자쪽지, 로그인시 동의창 등의 전자적 수단을 통해 따로 명확히
              통지하도록 합니다.
            </li>
            <li>
              ④ 회사가 전항에 따라 개정약관을 공지 또는 통지하면서 회원에게 30일
              기간 내에 의사표시를 하지 않으면 의사표시가 표명된 것으로 본다는
              뜻을 명확하게 공지 또는 통지하였음에도 회원이 명시적으로 거부의
              의사표시를 하지 아니한 경우 회원이 개정약관에 동의한 것으로
              봅니다.
            </li>
            <li>
              ⑤ 회원이 개정약관의 적용에 동의하지 않는 경우 회사는 개정 약관의
              내용을 적용할 수 없으며, 이 경우 회원은 이용계약을 해지할 수
              있습니다.
              <br />다만, 기존 약관을 적용할 수 없는 특별한 사정이 있는 경우에는
              회사는 이용계약을 해지할 수 있습니다.
            </li>
          </ol>
          <h3>제 4 조 (약관의 해석)</h3>
          <ol>
            <li>
              ① "회사"는 "유료서비스" 및 개별 서비스에 대해서는 별도의 이용약관
              및 정책(이하 "유료서비스약관 등")을 둘 수 있으며, 해당 내용이 이
              약관과 상충할 경우에는 "유료서비스약관 등"이 우선하여 적용됩니다.
            </li>
            <li>
              ② 이 약관에서 정하지 아니한 사항이나 해석에 대해서는
              "유료서비스약관 등" 및 관계법령 또는 상관례에 따릅니다.
            </li>
          </ol>
          <h3>제 5 조 (이용계약 체결)</h3>
          <ol>
            <li>
              ① 이용계약은 "회원"이 되고자 하는 자(이하 "가입신청자")가 약관의
              내용에 대하여 동의를 한 다음 원가입신청을 하고 "회사"가 이러한
              신청에 대하여 승낙함으로써 체결됩니다.
            </li>
            <li>
              ② "회사"는 "가입신청자"의 신청에 대하여 "서비스" 이용을 승낙함을
              원칙으로 합니다.&nbsp; <br />다만, "회사"는 다음 각 호에 해당하는
              신청에 대하여는 승낙을 하지 않거나 사후에 이용계약을 해지할 수
              있습니다.
            </li>
          </ol>
          <ol>
            <li>
              1. 가입신청자가 이 약관에 의하여 이전에 회원자격을 상실한 적이
              있는 경우, 단 "회사"의 회원 재가입 승낙을 얻은 경우에는 예외로 함.
            </li>
            <li>2. 실명이 아니거나 타인의 명의를 이용한 경우</li>
            <li>
              3. 허위의 정보를 기재하거나, "회사"가 제시하는 내용을 기재하지
              않은 경우
            </li>
            <li>
              4. 14세 미만 아동이 법정대리인(부모 등)의 동의를 얻지 아니한 경우
            </li>
            <li>
              5. 이용자의 귀책사유로 인하여 승인이 불가능하거나 기타 규정한 제반
              사항을 위반하며 신청하는 경우
            </li>
          </ol>
          <ol>
            <li>
              ③ 제1항에 따른 신청에 있어 "회사"는 "회원"의 종류에 따라
              전문기관을 통한 실명확인 및 본인인증을 요청할 수 있습니다.
            </li>
            <li>
              ④ "회사"는 서비스관련설비의 여유가 없거나, 기술상 또는 업무상
              문제가 있는 경우에는 승낙을 유보할 수 있습니다.
            </li>
            <li>
              ⑤ 제2항과 제4항에 따라 회원가입신청의 승낙을 하지 아니하거나
              유보한 경우, "회사"는 원칙적으로 이를 가입신청자에게 알리도록
              합니다.
            </li>
            <li>
              ⑥ 이용계약의 성립 시기는 "회사"가 가입완료를 신청절차 상에서
              표시한 시점으로 합니다.
            </li>
            <li>
              ⑦ "회사"는 "회원"에 대해 회사정책에 따라 등급별로 구분하여
              이용시간, 이용횟수, 서비스 메뉴 등을 세분하여 이용에 차등을 둘 수
              있습니다.
            </li>
            <li>
              ⑧ "회사"는 "회원"에 대하여 "영화및비디오물의진흥에관한법률" 및
              "청소년보호법"등에 따른 등급 및 연령 준수를 위해 이용제한이나
              등급별 제한을 할 수 있습니다.
            </li>
          </ol>
          <h3>제 6 조 (회원정보의 변경)</h3>
          <ol>
            <li>
              ① "회원"은 개인정보관리화면을 통하여 언제든지 본인의 개인정보를
              열람하고 수정할 수 있습니다. <br />다만, 서비스 관리를 위해 필요한
              실명, 주민등록번호, 아이디 등은 수정이 불가능합니다.
            </li>
            <li>
              ② "회원"은 회원가입신청 시 기재한 사항이 변경되었을 경우
              온라인으로 수정을 하거나 전자우편 기타 방법으로 "회사"에 대하여 그
              변경사항을 알려야 합니다.
            </li>
            <li>
              ③ 제2항의 변경사항을 "회사"에 알리지 않아 발생한 불이익에 대하여
              "회사"는 책임지지 않습니다.
            </li>
          </ol>
          <h3>제 7 조 (개인정보보호 의무)</h3>
          <p>
            "회사"는 "정보통신망법" 등 관계 법령이 정하는 바에 따라 "회원"의
            개인정보를 보호하기 위해 노력합니다. <br />
            개인정보의 보호 및 사용에 대해서는 관련법 및 "회사"의
            개인정보취급방침이 적용됩니다.&nbsp;<br />
            다만, "회사"의 공식 사이트 이외의 링크된 사이트에서는 "회사"의
            개인정보취급방침이 적용되지 않습니다.
          </p>
          <h3>제 8 조 ("회원"의 "아이디" 및 "비밀번호"의 관리에 대한 의무)</h3>
          <ol>
            <li>
              ① "회원"의 "아이디"와 "비밀번호"에 관한 관리책임은 "회원"에게
              있으며, 이를 제3자가 이용하도록 하여서는 안 됩니다.
            </li>
            <li>
              ② "회사"는 "회원"의 "아이디"가 개인정보 유출 우려가 있거나,
              반사회적 또는 미풍양속에 어긋나거나 "회사" 및 "회사"의 운영자로
              오인한 우려가 있는 경우, 해당 "아이디"의 이용을 제한할 수
              있습니다.
            </li>
            <li>
              ③ "회원"은 "아이디" 및 "비밀번호"가 도용되거나 제3자가 사용하고
              있음을 인지한 경우에는 이를 즉시 "회사"에 통지하고 "회사"의 안내에
              따라야 합니다.
            </li>
            <li>
              ④ 제3항의 경우에 해당 "회원"이 "회사"에 그 사실을 통지하지 않거나,
              통지한 경우에도 "회사"의 안내에 따르지 않아 발생한 불이익에 대하여
              "회사"는 책임지지 않습니다.
            </li>
          </ol>
          <h3>제 9 조 ("회원"에 대한 통지)</h3>
          <ol>
            <li></li>
            <li>
              ① "회사"가 "회원"에 대한 통지를 하는 경우 이 약관에 별도 규정이
              없는 한 서비스 내 전자우편주소, 전자쪽지 등으로 할 수 있습니다.
            </li>
            <li>
              ② "회사"는 "회원" 전체에 대한 통지의 경우 7일 이상 "회사"의
              게시판에 게시함으로써 제1항의 통지에 갈음할 수 있습니다.
            </li>
          </ol>
          <h3>제 10 조 ("회사"의 의무)</h3>
          <ol>
            <li></li>
            <li>
              ① "회사"는 관련법과 이 약관이 금지하거나 미풍양속에 반하는 행위를
              하지 않으며, 계속적이고 안정적으로 "서비스"를 제공하기 위하여
              최선을 다하여 노력합니다.
            </li>
            <li>
              ② "회사"는 "회원"이 안전하게 "서비스"를 이용할 수 있도록
              개인정보(신용정보 포함)보호를 위해 보안시스템을 갖추어야 하며
              개인정보취급방침을 공시하고 준수합니다.
            </li>
            <li>
              ③ "회사"는 서비스이용과 관련하여 "회원"으로부터 제기된 의견이나
              불만이 정당하다고 인정할 경우에는 이를 처리하여야 합니다. "회원"이
              제기한 의견이나 불만사항에 대해서는 게시판을 활용하거나 전자우편
              등을 통하여 "회원"에게 처리과정 및 결과를 전달합니다.
            </li>
          </ol>
          <h3>제 11 조 ("회원"의 의무)</h3>
          <ol>
            <li>① "회원"은 다음 행위를 하여서는 안 됩니다.</li>
            <ol>
              <li>1. 신청 또는 변경 시 허위내용의 등록</li>
              <li>2. 타인의 정보도용</li>
              <li>3. "회사"가 게시한 정보의 변경</li>
              <li>
                4. "회사"가 정한 정보 이외의 정보(컴퓨터 프로그램 등) 등의 송신
                또는 게시
              </li>
              <li>5. "회사"와 기타 제3자의 저작권 등 지적재산권에 대한 침해</li>
              <li>
                6. "회사" 및 기타 제3자의 명예를 손상시키거나 업무를 방해하는
                행위
              </li>
              <li>
                7. 외설 또는 폭력적인 메시지, 화상, 음성, 기타 공서양속에 반하는
                정보를 "서비스"에 공개 또는 게시하는 행위
              </li>
              <li>
                8. 회사의 동의 없이 영리를 목적으로 "서비스"를 사용하는 행위
              </li>
              <li>9. 기타 불법적이거나 부당한 행위</li>
            </ol>
          </ol>
          <ol>
            <li>
              ② "회원"은 관계법, 이 약관의 규정, 이용안내 및 "서비스"와 관련하여
              공지한 주의사항, "회사"가 통지하는 사항 등을 준수하여야 하며, 기타
              "회사"의 업무에 방해되는 행위를 하여서는 안 됩니다.
            </li>
          </ol>
          <h3>제 12 조 ("서비스"의 제공 등)</h3>
          <ol>
            <li>
              ① 회사는 "서비스"를 일정범위로 분할하여 각 범위 별로
              이용가능시간을 별도로 지정할 수 있습니다. <br />다만, 이러한
              경우에는 그 내용을 사전에 공지합니다.
            </li>
            <li>② "서비스"는 연중무휴, 1일 24시간 제공함을 원칙으로 합니다.</li>
            <li>
              ③ "회사"는 컴퓨터 등 정보통신설비의 보수점검, 교체 및 고장,
              통신두절 또는 운영상 상당한 이유가 있는 경우 "서비스"의 제공을
              일시적으로 중단할 수 있습니다. 이 경우 "회사"는 제9조["회원"에
              대한 통지]에 정한 방법으로 "회원"에게 통지합니다. <br />다만,
              "회사"가 사전에 통지할 수 없는 부득이한 사유가 있는 경우 사후에
              통지할 수 있습니다.
            </li>
            <li>
              ④ "회사"는 서비스의 제공에 필요한 경우 정기점검을 실시할 수
              있으며, 정기점검시간은 서비스제공화면에 공지한 바에 따릅니다.
            </li>
          </ol>
          <h3>제 13 조 ("서비스"의 변경)</h3>
          <ol>
            <li>
              ① "회사"는 상당한 이유가 있는 경우에 운영상, 기술상의 필요에 따라
              제공하고 있는 전부 또는 일부 "서비스"를 변경할 수 있습니다.
            </li>
            <li>
              ② "서비스"의 내용, 이용방법, 이용시간에 대하여 변경이 있는
              경우에는 변경사유, 변경될 서비스의 내용 및 제공일자 등은 그 변경
              전에 해당 서비스 초기화면에 게시하여야 합니다.
            </li>
            <li>
              ③ "회사"는 무료로 제공되는 서비스의 일부 또는 전부를 회사의 정책
              및 운영의 필요상 수정, 중단, 변경할 수 있으며, 이에 대하여
              관련법에 특별한 규정이 없는 한 "회원"에게 별도의 보상을 하지
              않습니다.
            </li>
          </ol>
          <h3>제 14 조 (정보의 제공 및 광고의 게재)</h3>
          <ol>
            <li>
              ① "회사"는 "회원"이 "서비스" 이용 중 필요하다고 인정되는 다양한
              정보를 공지사항이나 전자우편 등의 방법으로 "회원"에게 제공할 수
              있습니다.&nbsp; <br />다만, "회원"은 관련법에 따른 거래관련 정보
              및 고객문의 등에 대한 답변 등을 제외하고는 언제든지 전자우편에
              대해서 수신 거절을 할 수 있습니다.
            </li>
            <li>
              ② 제1항의 정보를 전화 및 모사전송기기에 의하여 전송하려고 하는
              경우에는 "회원"의 사전 동의를 받아서 전송합니다.&nbsp;
              <br />다만, "회원"의 거래관련 정보 및 고객문의 등에 대한 회신에
              있어서는 제외됩니다.
            </li>
            <li>
              ③ "회사"는 "서비스"의 운영과 관련하여 서비스 화면, 홈페이지,
              전자우편 등에 광고를 게재할 수 있습니다. 광고가 게재된 전자우편을
              수신한 "회원"은 수신거절을 "회사"에게 할 수 있습니다.
            </li>
            <li>
              ④ "이용자(회원, 비회원 포함)"는 회사가 제공하는 서비스와 관련하여
              게시물 또는 기타 정보를 변경, 수정, 제한하는 등의 조치를 취하지
              않습니다.
            </li>
          </ol>
          <h3>제 15 조 ("게시물"의 저작권)</h3>
          <ol>
            <li>
              ① "회원"이 "서비스" 내에 게시한 "게시물"의 저작권은 해당 게시물의
              저작자에게 귀속됩니다.
            </li>
            <li>
              ② "회원"이 "서비스" 내에 게시하는 "게시물"은 검색결과 내지
              "서비스" 및 관련 프로모션 등에 노출될 수 있으며, 해당 노출을 위해
              필요한 범위 내에서는 일부 수정, 복제, 편집되어 게시될 수 있습니다.
              이 경우, 회사는 저작권법 규정을 준수하며, "회원"은 언제든지
              고객센터 또는 "서비스" 내 관리기능을 통해 해당 게시물에 대해 삭제,
              검색결과 제외, 비공개 등의 조치를 취할 수 있습니다.
            </li>
            <li>
              ③ "회사"는 제2항 이외의 방법으로 "회원"의 "게시물"을 이용하고자
              하는 경우에는 전화, 팩스, 전자우편 등을 통해 사전에 "회원"의
              동의를 얻어야 합니다.
            </li>
          </ol>
          <h3>제 16 조 ("게시물"의 관리)</h3>
          <ol>
            <li>
              ① "회원"의 "게시물"이 "정보통신망법" 및 "저작권법"등 관련법에
              위반되는 내용을 포함하는 경우, 권리자는 관련법이 정한 절차에 따라
              해당 "게시물"의 게시중단 및 삭제 등을 요청할 수 있으며, "회사"는
              관련법에 따라 조치를 취하여야 합니다.
            </li>
            <li>
              ② "회사"는 전항에 따른 권리자의 요청이 없는 경우라도 권리침해가
              인정될 만한 사유가 있거나 기타 회사 정책 및 관련법에 위반되는
              경우에는 관련법에 따라 해당 "게시물"에 대해 임시조치 등을 취할 수
              있습니다.
            </li>
            <li>
              ③ 본 조에 따른 세부절차는 "정보통신망법" 및 "저작권법"이 규정한
              범위 내에서 "회사"가 정한 "게시중단요청서비스"에 따릅니다.
              게시중단요청서비스 ljh3952@tdi9.com 이메일로 문의
            </li>
          </ol>
          <h3>제 17 조 (권리의 귀속)</h3>
          <ol>
            <li>
              ① "서비스"에 대한 저작권 및 지적재산권은 "회사"에 귀속됩니다. 단,
              "회원"의 "게시물" 및 제휴계약에 따라 제공된 저작물 등은
              제외합니다.
            </li>
            <li>
              ② "회사"는 서비스와 관련하여 "회원"에게 "회사"가 정한 이용조건에
              따라 계정, "아이디", 콘텐츠, "포인트" 등을 이용할 수 있는
              이용권만을 부여하며, "회원"은 이를 양도, 판매, 담보제공 등의
              처분행위를 할 수 없습니다.
            </li>
          </ol>
          <h3>제 18 조 (계약해제, 해지 등)</h3>
          <ol>
            <li>
              ① "회원"은 언제든지 서비스초기화면의 고객센터 또는 내 정보 관리
              메뉴 등을 통하여 이용계약 해지 신청을 할 수 있으며, "회사"는
              관련법 등이 정하는 바에 따라 이를 즉시 처리하여야 합니다.
            </li>
            <li>
              ② "회원"이 계약을 해지할 경우, 관련법 및 개인정보취급방침에 따라
              "회사"가 회원정보를 보유하는 경우를 제외하고는 해지 즉시 "회원"의
              모든 데이터는 소멸됩니다.
            </li>
            <li>
              ③ "회원"이 계약을 해지하는 경우, "회원"이 작성한 "게시물" 중 메일,
              블로그 등과 같이 본인 계정에 등록된 게시물 일체는 삭제됩니다.
              다만, 타인에 의해 담기, 스크랩 등이 되어 재게시되거나,
              공용게시판에 등록된 "게시물" 등은 삭제되지 않으니 사전에 삭제 후
              탈퇴하시기 바랍니다.
            </li>
          </ol>
          <h3>제 19 조 (이용제한 등)</h3>
          <ol>
            <li>
              ① "회사"는 "회원"이 이 약관의 의무를 위반하거나 "서비스"의
              정상적인 운영을 방해한 경우, 경고, 일시정지, 영구이용정지 등으로
              "서비스" 이용을 단계적으로 제한할 수 있습니다.
            </li>
            <li>
              ② "회사"는 전항에도 불구하고, "주민등록법"을 위반한 명의도용 및
              결제도용, "저작권법" 및 "컴퓨터프로그램보호법"을 위반한
              불법프로그램의 제공 및 운영방해, "정보통신망법"을 위반한 불법통신
              및 해킹, 악성프로그램의 배포, 접속권한 초과행위 등과 같이 관련법을
              위반한 경우에는 즉시 영구이용정지를 할 수 있습니다. 본 항에 따른
              영구이용정지 시 "서비스" 이용을 통해 획득한 "포인트" 및 기타 혜택
              등도 모두 소멸되며, "회사"는 이에 대해 별도로 보상하지 않습니다.
            </li>
            <li>
              ③ "회사"는 "회원"이 계속해서 3개월 이상 로그인하지 않는 경우,
              회원정보의 보호 및 운영의 효율성을 위해 이용을 제한할 수 있습니다.
            </li>
            <li>
              ④ "회사"는 본 조의 이용제한 범위 내에서 제한의 조건 및 세부내용은
              이용제한정책 및 개별 서비스상의 운영정책에서 정하는 바에 의합니다.
            </li>
            <li>
              ⑤ 본 조에 따라 "서비스" 이용을 제한하거나 계약을 해지하는 경우에는
              "회사"는 제9조["회원"에 대한 통지]에 따라 통지합니다.
            </li>
            <li>
              ⑥ "회원"은 본 조에 따른 이용제한 등에 대해 "회사"가 정한 절차에
              따라 이의신청을 할 수 있습니다. 이 때 이의가 정당하다고 "회사"가
              인정하는 경우 "회사"는 즉시 "서비스"의 이용을 재개합니다.
            </li>
          </ol>
          <h3>제 20 조 (책임제한)</h3>
          <ol>
            <li>
              ① "회사"는 천재지변 또는 이에 준하는 불가항력으로 인하여
              "서비스"를 제공할 수 없는 경우에는 "서비스" 제공에 관한 책임이
              면제됩니다.
            </li>
            <li>
              ② "회사"는 "회원"의 귀책사유로 인한 "서비스" 이용의 장애에
              대하여는 책임을 지지 않습니다.
            </li>
            <li>
              ③ "회사"는 "회원"이 "서비스"와 관련하여 게재한 정보, 자료, 사실의
              신뢰도, 정확성 등의 내용에 관하여는 책임을 지지 않습니다.
            </li>
            <li>
              ④ "회사"는 "회원" 간 또는 "회원"과 제3자 상호간에 "서비스"를
              매개로 하여 거래 등을 한 경우에는 책임이 면제됩니다.
            </li>
            <li>
              ⑤ "회사"는 무료로 제공되는 서비스 이용과 관련하여 관련법에 특별한
              규정이 없는 한 책임을 지지 않습니다.
            </li>
          </ol>
          <h3>제 21 조 (준거법 및 재판관할)</h3>
          <ol>
            <li>
              ① "회사"와 "회원" 간 제기된 소송은 대한민국법을 준거법으로 합니다.
            </li>
            <li>
              ② "회사”와 “회원”간 발생한 분쟁에 관한 소송은 제소 당시의 “회원”의
              주소에 의하고, 주소가 없는 경우 거소를 관할하는 지방법원의
              전속관할로 합니다. 단, 제소 당시 “회원”의 주소 또는 거소가
              명확하지 아니한 경우의 관할법원은 민사소송법에 따라 정합니다.
            </li>
            <li>
              ③ 해외에 주소나 거소가 있는 ‘회원’의 경우 ‘회사’와 ‘회원’간 발생한
              분쟁에 관한 소송은 전항에도 불구하고 대한민국 서울중앙지방법원을
              관할 법원으로 합니다.
            </li>
          </ol>
          <p>부칙 <br />① 이 약관은 2022년 9월 1일부터 적용됩니다.</p>
        </div>
        <div v-else>
          <h3>1. 개인정보처리방침이란?</h3>
          <br />
          <p>
            주식회사 티디아이 플레이(이하 "회사”)는 이용자의 ‘동의를 기반으로
            개인정보를 수집·이용 및 제공’하고 있으며, ‘이용자의 권리 (개인정보
            자기결정권)를 적극적으로 보장’합니다.
          </p>
          <p>
            회사는 정보통신서비스제공자가 준수하여야 하는 대한민국의 관계 법령
            및 개인정보보호 규정, 가이드라인을 준수하고 있습니다.
          </p>
          <p>
            “개인정보 처리방침”이란 이용자의 소중한 개인정보를 보호함으로써
            이용자가 안심하고 서비스를 이용할 수 있도록 회사가 준수해야 할
            지침을 의미합니다.
          </p>
          <p>
            본 개인정보 처리방침은 “정음” 서비스(이하 '정음' 또는 '서비스'라
            함)에 적용됩니다.
          </p>
          <p><br /></p>
          <h3>2. 개인정보 수집</h3>
          <br />
          <p>서비스 제공을 위한 필요 최소한의 개인정보를 수집하고 있습니다.</p>
          <p>
            회원 가입 시 또는 서비스 이용 과정에서 홈페이지 또는 개별
            어플리케이션이나 프로그램 등을 통해 아래와 같은 서비스 제공을 위해
            필요한 최소한의 개인정보를 수집하고 있습니다.
          </p>
          <p>[정음]</p>
          <ol>
            <li>
              ① 필수 : (국가번호포함) 휴대폰 번호, 스마트폰 등 단말기 주소록
              내에 저장된 연락처 정보(제3자의 전화번호, 이름), 이용자
              이름(닉네임), 사업자등록번호(캐시노트에 등록된), 업태, 업종
            </li>
          </ol>
          <p></p>
          <p>[정음 계정]</p>
          <ol>
            <li>① 필수 : 이메일, 비밀번호, 이름, 연락처</li>
            <li>② 선택 : 생년월일, 성별</li>
          </ol>
          <p></p>
          <p>[고객센터]</p>
          <ol>
            <li>① 필수 : 전화번호, 이메일, 휴대폰번호</li>
          </ol>
          <p></p>
          <p>
            일부 서비스에서는 특화된 여러 기능들을 제공하기 위해 ‘정음계정’에서
            공통으로 수집하는 정보 외 이용자 동의 후 추가적인 개인정보를 수집할
            수 있습니다.
          </p>
          <ol>
            <li>
              ① 필수정보란? : 해당 서비스의 본질적 기능을 수행하기 위한 정보
            </li>
            <li>
              ② 선택정보란? : 보다 특화된 서비스를 제공하기 위해 추가 수집하는
              정보 (선택 정보를 입력하지 않은 경우에도 서비스 이용 제한은
              없습니다.)
            </li>
          </ol>
          <p></p>
          <p>
            ※ 고객센터로 문의/신고 시 위와 같은 정보를 수집할 수 있으며,
            문의/신고 유형에 따라 휴대폰 번호 등 회원님께서 추가로 입력하시는
            개인정보가 있을 수 있습니다.
          </p>
          <p>개인정보를 수집하는 방법은 다음과 같습니다.</p>
          <p>
            개인정보를 수집하는 경우에는 반드시 사전에 이용자에게 해당 사실을
            알리고 동의를 구하고 있으며, 아래와 같은 방법을 통해 개인정보를
            수집합니다.
          </p>
          <ol>
            <li>
              ① 회원가입 및 서비스 이용 과정에서 이용자가 개인정보 수집에 대해
              동의를 하고 직접 정보를 입력하는 경우
            </li>
            <li>② 제휴 서비스 또는 단체 등으로부터 개인정보를 제공받은 경우</li>
            <li>
              ③ 고객센터를 통한 상담 과정에서 웹페이지, 메일, 팩스, 전화 등
            </li>
            <li>④ 온·오프라인에서 진행되는 이벤트/행사 등 참여</li>
          </ol>
          <p></p>
          <p>
            서비스 이용 과정에서 이용자로부터 수집하는 개인정보는 아래와
            같습니다.
          </p>
          <p>
            PC웹, 모바일 웹/앱 이용 과정에서 단말기정보(OS, 화면사이즈, 디바이스
            아이디), IP주소, 쿠키, 방문일시, 부정이용기록, 서비스 이용 기록 등의
            정보가 자동으로 생성되어 수집될 수 있습니다.
          </p>
          <p>
            서비스 간 제휴, 연계 등으로 제3자로부터 개인정보를 제공받고
            있습니다.
          </p>
          <p>&nbsp;</p>
          <h3>3. 개인정보 이용</h3>
          <br />
          <p>
            회원관리, 서비스 제공·개선, 신규 서비스 개발 등을 위해 이용합니다.
          </p>
          <p>
            회원 가입 시 또는 서비스 이용 과정에서 홈페이지 또는 개별
            어플리케이션이나 프로그램 등을 통해 아래와 같이 서비스 제공을 위해
            필요한 최소한의 개인정보를 수집하고 있습니다.
          </p>
          <ol>
            <li>① 회원 식별/가입의사 확인, 본인/연령 확인, 부정이용 방지</li>
            <li>② 인구통계학적 특성에 따른 분석 및 서비스 제공</li>
            <li>
              ③ 신규 서비스 개발, 다양한 서비스 제공, 문의사항 또는 불만처리,
              공지사항 전달
            </li>
            <li>④ 유료서비스 이용 시 컨텐츠 등의 전송이나 배송·요금 정산</li>
            <li>
              ⑤ 서비스의 원활한 운영에 지장을 주는 행위(계정 도용 및 부정 이용
              행위 등 포함)에 대한 방지 및 제재
            </li>
            <li>⑥ 이벤트/행사 참여 확인, 마케팅 및 광고 등에 활용</li>
            <li>
              ⑦ 서비스 이용 기록, 접속 빈도 및 서비스 이용에 대한 통계,
              프라이버시 보호 측면의 서비스 환경 구축, 맞춤형 서비스 제공,
              서비스 개선에 활용
            </li>
          </ol>
          <p><br /></p>
          <h3>4. 개인정보 제공</h3>
          <br />
          <p>
            회사는 이용자의 별도 동의가 있는 경우나 법령에 규정된 경우를
            제외하고는 이용자의 개인정보를 제3자에게 제공하지 않습니다.
          </p>
          <p>
            제3자와의 서비스 연결을 위해 아래와 같이 개인정보를 제공하고
            있습니다.
          </p>
          <p>
            회사는 이용자의 사전 동의 없이 개인정보를 외부에 제공하지 않습니다.
          </p>
          <p>
            단, 이용자가 외부 제휴사 등의 서비스를 이용하기 위하여 필요한 범위
            내에서 이용자의 동의를 얻은 후에 개인정보를 제3자에게 제공하고
            있습니다.
          </p>
          <p>&nbsp;</p>
          <h3>5. 개인정보 파기</h3>
          <br />
          <p>
            개인정보는 수집 및 이용목적이 달성되면 지체없이 파기하며, 절차 및
            방법은 다음과 같습니다.
          </p>
          <p>
            전자적 파일 형태인 경우 복구 및 재생되지 않도록 안전하게 삭제하고,
            그 밖에 기록물, 인쇄물, 서면 등의 경우 분쇄하거나 소각하여
            파기합니다.
          </p>
          <p>다만, 내부방침에 보관 후 파기하는 정보는 아래와 같습니다.</p>
          <p>아래 정보는 탈퇴일부터 최대 1년간 보관 후 파기합니다.</p>
          <ol>
            <li>
              ① 안내메일 발송 및 CS문의 대응을 위해 정음계정과 탈퇴안내 이메일
              주소를 암호화하여 보관
            </li>
            <li>② 서비스 부정이용 기록</li>
          </ol>
          <p>&nbsp;</p>
          <p>
            또한, 회사는 ‘개인정보 유효기간제’에 따라 1년간 서비스를 이용하지
            않은 회원의 개인정보를 별도로 분리 보관 또는 삭제하고 있으며,
          </p>
          <p>분리 보관된 개인정보는 4년간 보관 후 지체없이 파기합니다.</p>
          <p>&nbsp;</p>
          <h3>6. 기타</h3>
          <br />
          <p>티디아이 플레이는 여러분의 권리를 보호합니다.</p>
          <p>
            이용자는 언제든지 자신의 개인정보를 조회하거나 수정할 수 있으며,
            수집・이용, 제공에 대한 동의 철회 또는 가입 해지를 요청할 수
            있습니다.
          </p>
          <p>
            보다 구체적으로는 서비스 내 설정 기능을 통한 변경, 가입 해지(동의
            철회)를 위해서는 서비스 내 "계정삭제"를 문의하면 되며, 고객센터를
            통해 서면, 전화 또는 이메일로 연락하시면 지체 없이 조치하겠습니다.
          </p>
          <p>
            개인정보의 오류에 대한 정정을 요청하신 경우 정정을 완료하기 전까지
            해당 개인정보를 이용 또는 제공하지 않습니다.
          </p>
          <p>&nbsp;</p>
          <p>PC 기반 서비스의 제공을 위하여 쿠키를 이용하는 경우가 있습니다.</p>
          <p>
            쿠키는 보다 빠르고 편리한 웹사이트 사용을 지원하고 맞춤형 서비스를
            제공하기 위해 사용됩니다.
          </p>
          <p><strong>쿠키란?</strong></p>
          <p>
            웹사이트를 운영하는데 이용되는 서버가 이용자의 브라우저에 보내는
            아주 작은 텍스트 파일로서 이용자 컴퓨터에 저장됩니다.
          </p>
          <p><strong>사용목적</strong></p>
          <p>
            개인화되고 맞춤화된 서비스를 제공하기 위해서 이용자의 정보를
            저장하고 수시로 불러오는 쿠키를 사용합니다. 이용자가 웹사이트에
            방문할 경우 웹 사이트 서버는 이용자의 디바이스에 저장되어 있는
            쿠키의 내용을 읽어 이용자의 환경설정을 유지하고 맞춤화된 서비스를
            제공하게 됩니다. 쿠키는 이용자가 웹 사이트를 방문할 때, 웹 사이트
            사용을 설정한대로 접속하고 편리하게 사용할 수 있도록 돕습니다. 또한,
            이용자의 웹사이트 방문 기록, 이용 형태를 통해서 최적화된 광고 등
            맞춤형 정보를 제공하기 위해 활용됩니다.
          </p>
          <p><strong>쿠키 수집 거부</strong></p>
          <p>
            쿠키에는 이름, 전화번호 등 개인을 식별하는 정보를 저장하지 않으며,
            이용자는 쿠키 설치에 대한 선택권을 가지고 있습니다. 따라서, 이용자는
            웹 브라우저에서 옵션을 설정함으로써 모든 쿠키를 허용하거나, 쿠키가
            저장될 때마다 확인을 거치거나, 모든 쿠키의 저장을 거부할 수도
            있습니다. 다만, 쿠키 설치를 거부할 경우 웹 사용이 불편해지며,
            로그인이 필요한 일부 서비스 이용에 어려움이 있을 수 있습니다.
          </p>
          <p><strong>설정 방법의 예</strong></p>
          <p>1) Internet Explorer의 경우</p>
          <p>
            웹 브라우저 상단의 도구 메뉴 &gt; 인터넷 옵션 &gt; 개인정보 &gt;
            설정
          </p>
          <p>2) Chrome의 경우</p>
          <p>
            웹 브라우저 우측의 설정 메뉴 &gt; 화면 하단의 고급 설정 표시 &gt;
            개인정보의 콘텐츠 설정 버튼 &gt; 쿠키
          </p>
          <p><strong>개인정보보호와 관련해서 궁금하신 사항은?</strong></p>
          <p>
            서비스를 이용하면서 발생하는 모든 개인정보보호 관련 문의, 불만,
            조언이나 기타 사항은 개인정보 보호책임자 및 담당부서로 연락해 주시기
            바랍니다. 티디아이 플레이는 여러분의 목소리에 귀 기울이고 신속하고
            충분한 답변을 드릴 수 있도록 최선을 다하겠습니다.
          </p>
          <p><strong>개인정보 보호책임자 및 담당부서</strong></p>
          <p>책임자: 김홍섭 (개인정보 보호책임자)</p>
          <p>담당부서: 개발본부</p>
          <p>문의 : 고객센터 : 070-4138-1644</p>
          <p><strong>개인정보 처리방침이 변경되는 경우</strong></p>
          <p>
            법률이나 서비스의 변경사항을 반영하기 위한 목적 등으로 개인정보
            처리방침을 수정할 수 있습니다. 개인정보 처리방침이 변경되는 경우
            회사는 변경 사항을 게시하며, 변경된 개인정보 처리방침은 게시한
            날로부터 7일 후부터 효력이 발생합니다.
          </p>
          <p>
            다만, 수집하는 개인정보의 항목, 이용목적의 변경 등과 같이 이용자
            권리의 중대한 변경이 발생할 때에는 최소 30일 전에 미리
            알려드리겠습니다.
          </p>
          <p>&nbsp;</p>
          <p>공고일자: 2022년 9월 1일</p>
          <p>시행일자: 2021년 9월 8일</p>
          <p><br /></p>
        </div>
      </div>
    </div>
    <div class="modal_bg" @click="closeModal"></div>
  </div>
</template>
<script lang="ts" setup>
const props = defineProps(["modalText", "modal"]);

const emit = defineEmits<{
  (e: "close-modal", value?: any): void;
}>();
const closeModal = () => emit("close-modal");
</script>
<style lang="css" scoped>
h3 {
  font-size: 16px;
  font-weight: bold;
}
p,
li {
  font-size: 14px;
}
/* modal */
.modal {
  display: block;
  position: fixed;
  left: 0;
  top: 0;
  width: 100%;
  height: 100%;
  z-index: 99999;
  transition: all 0.3s ease;
}
.modal_con {
  position: fixed;
  background-color: #fff;
  border-radius: 8px;
  max-width: 600px;
  width: calc(100% - 32px);
  height: 600px;
  left: 50%;
  top: 50%;
  z-index: 99;
  box-sizing: border-box;
  transform: translate(-50%, -50%);
  padding-bottom: 10px;
}
.modal_con.pass {
  max-width: 380px;
  text-align: center;
  height: 302px;
  box-sizing: border-box;
}
.modal_con.pass button {
  height: 52px;
  width: 160px;
  background-color: #ef4118;
  border-radius: 26px;
  color: white;
  font-size: 16px;
  font-weight: bold;
}
.modal_con.pass .sucess_con h3 {
  font-size: 22px;
  font-weight: bold;
}
.modal_bg {
  position: fixed;
  top: 0;
  left: 0;
  height: 100%;
  z-index: 88;
  width: 100%;
  background-color: rgba(0, 0, 0, 0.3);
}
.modal_header {
  display: flex;
  justify-content: space-between;
  padding: 30px;
}
.modal_header h2 {
  font-size: 20px;
  font-weight: bold;
  color: #111;
}
.modal_header .modal_close_btn {
  width: 24px;
  height: 24px;
  cursor: pointer;
}

.modal_text {
  height: calc(100% - 90px);
  padding: 0 30px 30px;
  width: 100%;
  overflow: auto;
  color: #000000d9;
  line-height: 2;
}
.modal_text h3 {
  font-size: 16px;
  margin-bottom: 10px !important;
}
.modal_text ol {
  padding-left: 20px !important;
}
</style>
